---
type: FabricationVersionInfo
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# FabricationVersionInfo

`Autodesk.Revit.DB.FabricationVersionInfo` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Reason | 2019 | `public string Reason { get ; }` |
| Property | Version | 2019 | `public int Version { get ; }` |